package actual.XieCheng;

/**
 * 题目描述：
 * 正值下班高峰时期，现有可载客司机数2N人，调度中心将调度相关司机服务A、B两个出行高峰区域。
 *
 * 第 i 个司机前往服务A区域可得收入为 income[i][0]，前往服务B区域可得收入为 income[i][1]。
 *
 * 返回将每位司机调度完成服务后，所有司机总可得的最高收入金额，要求每个区域都有 N 位司机服务。
 *
 *
 *
 * 输入描述
 * 10 20
 *
 * 20 40
 *
 * #
 *
 * 如上：
 *
 * 第一个司机服务 A 区域，收入为 10元
 *
 * 第一个司机服务 B 区域，收入为 20元
 *
 *
 * 第二个司机服务 A 区域，收入为 20元
 *
 * 第二个司机服务 B 区域，收入为 40元
 *
 * 输入参数以 '#' 结束输入
 *
 * 样例输入
 * 10 30
 * 100 200
 * 150 50
 * 60 20
 * #
 * 样例输出
 * 440
 */
public class ScheduleBus {
}
